import type { Metadata } from "next";
import "./globals.css";
import "../../fonts/fontNunitoSans/style.css";

import { montserrat } from "@/fonts/fontMontserrat";
import { NextIntlClientProvider, hasLocale } from "next-intl";
import { notFound } from "next/navigation";
import { routing } from "@/i18n/routing";
import { SuspenseWithLoader } from "@/components/ui/suspense-with-loader";

export const metadata: Metadata = {
  title: "A3 ПРИНТ",
  description:
    "Типография полного цикла в Алматы. Печать визиток, баннеров, каталогов и полиграфии в Алматы. Быстро, качественно и недорого. Типография A3 ПРИНТ.",
  keywords: [
    "A3 ПРИНТ",
    "A3ПРИНТ",
    "A3 Print",
    "A3Print",
    "Типография",
    "Алматы",
    // ruTabs
    "Визитки",
    "Листовки",
    "Буклеты",
    "Брошюры",
    "Плакаты",
    "Открытки",
    "Пригласительные",
    "Календари",
    "Наклейки",
    "Стикеры",
    "Папки",
    "Сертификаты",
    "Дипломы",
    "Каталоги",
    "Упаковка",
    "Журналы",
    "Этикетки",
    "Баннеры",
    "Входные группы",
    "Штендеры",
    "Таблички",
    "Лайтбоксы",
    "Брендволлы",
    "Плакаты",
    "Оформление витрин",
    "Оклейка транспорта",
    "POS-материалы",
    "Промостойки",
    "Ролл-апы",
    "Пресс-воллы",
    "Интерьерные стенды",
    "Самоклеящиеся плёнки",
    "Печать на пластике, стекле, металле, дереве",
    "Печать на ткани",
    "Фотообои",
    "Печать на сетке",
    "Стикеры для витрин",
    "Магниты",
    "Ручки с логотипом",
    "Ежедневники с логотипом",
    "Брелоки",
    "Кружки с печатью",
    "Эко-сумки / Шоперы",
    "Флешки с брендированием",
    "Зонты с логотипом",
    "Подарочные пакеты",
    "Значки",
    "Магниты сувенирные",
    "Футболки / Худи",
    "Чехлы для телефона",
    "Подготовка макетов к печати",
    "Дизайн визиток, листовок, буклетов и т.д.",
    "Создание макетов упаковки и высечных форм",
    "Верстка брошюр, каталогов, журналов",
    "Дизайн для широкоформатной и сувенирной продукции",
    "Создание и обрисовка  логотипа",
    "Картонные коробки (самосборные, на замке, с крышкой)",
    "Упаковка с высечкой по форме изделия",
    "Подарочные коробки (ламинированные, кашированные)",
    "Вкладыши / ложементы из картона",
    "Обечайки / муфты",
    "Крафт-пакеты с печатью",
    "Обёрточная бумага / брендированная калька",
    "Картонные бирки / ярлыки",
    "Этикетки на крафт-бумаге",
    "Бумажные ленты с логотипом",

    // kzTabs
    "Визиткалар",
    "Парақшалар",
    "Буклеттер",
    "Брошюралар",
    "Плакаттар",
    "Ашық хаттар",
    "Шақыру билеттері",
    "Күнтізбелер",
    "Жапсырмалар",
    "Стикерлер",
    "Папкалар",
    "Сертификаттар",
    "Дипломдар",
    "Каталогтар",
    "Қаптама",
    "Журналдар",
    "Этикеткалар",
    "Баннерлер",
    "Кіру топтары",
    "Штендер",
    "Маңдайшалар",
    "Лайтбокстар",
    "Брендволдар",
    "Плакаттар",
    "Витриналарды безендіру",
    "Көлікке жапсырмалар жапсыру",
    "POS материалдары",
    "Промо бағандар",
    "Ролл-ап",
    "Пресс-волл",
    "Интерьер стендтері",
    "Өздігінен жабысатын пленкалар",
    "Пластмасса, шыны, металл, ағашқа басып шығару",
    "Матаға басып шығару",
    "Фото тұсқағаз",
    "Торға басып шығару",
    "Витриналарға арналған стикерлер",
    "Магниттер",
    "Логотипі бар қаламдар",
    "Логотипі бар күнделіктер",
    "Әшекей ілгіштер",
    "Суреті бар кружкалар",
    "Эко сөмкелер / Шоперлер",
    "Брендтік флэш-дискілер",
    "Логотипі бар қолшатырлар",
    "Сыйлық пакеттері",
    "Белгішелер",
    "Кәдесый магниттер",
    "Футболкалар / Капюшондар",
    "Телефон қаптары",
    "Макеттерді басып шығаруға дайындау",
    "Визиткалар, парақшалар, буклеттер және т. б.",
    "Қаптама макеттерін және кескіш пішіндерді жасау",
    "Брошюраларды, каталогтарды, журналдарды орналастыру",
    "Үлкен форматты және кәдесый өнімдеріне арналған дизайн",
    "Логотипті жасау және сызу",
    "Картон қораптар (өздігінен жиналатын, құлыпталатын, қақпағы бар)",
    "Бұйым формасына қарай ойылған қаптама",
    "Сыйлық қораптары (ламинатталған, кашталған)",
    "Картоннан жасалған төсемдер / ложементтер",
    "Қаптар / муфталар",
    "Басып шығарылған крафт-пакеттер",
    "Орау қағазы / брендтік калька",
    "Картон биркалар/ жапсырмалар",
    "Крафт қағаз жапсырмалары",
    "Логотипі бар қағаз таспалар",
  ],
  alternates: {
    canonical: "https://a3print.kz",
  },
};

export default async function RootLayout({
  children,
  params,
}: Readonly<{
  children: React.ReactNode;
  params: Promise<{ locale: string }>;
}>) {
  const { locale } = await params;
  if (!hasLocale(routing.locales, locale)) {
    notFound();
  }

  return (
    <html lang={locale} className={`${montserrat.variable}`}>
      <body suppressHydrationWarning>
        <NextIntlClientProvider>
          <SuspenseWithLoader>{children}</SuspenseWithLoader>
        </NextIntlClientProvider>
      </body>
    </html>
  );
}
